; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-22)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 room3)
(at ball16 room3)
(at ball17 room3)
(at ball18 room4)
(at ball19 room4)
(at ball20 room4)
(at ball21 room4)
(at ball22 room4)
(at-robby rooma)
)
(:goal
(and
(at ball1 roomb)
(at ball2 roomb)
(at ball3 roomb)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 roomb)
(at ball16 roomb)
(at ball17 roomb)
(at ball18 roomb)
(at ball19 roomb)
(at ball20 roomb)
(at ball21 roomb)
(at ball22 roomb)
)
)
)

; plan
1. (pick ball5 rooma left)
   deleted: (at ball5 rooma) (free left)
   added: (carry ball5 left)
   goals met: 9 of 22
2. (pick ball4 rooma right)
   deleted: (at ball4 rooma) (free right)
   added: (carry ball4 right)
   goals met: 9 of 22
3. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 9 of 22
4. (drop ball4 roomb right)
   deleted: (carry ball4 right)
   added: (at ball4 roomb) (free right)
   goals met: 10 of 22
5. (drop ball5 roomb left)
   deleted: (carry ball5 left)
   added: (at ball5 roomb) (free left)
   goals met: 11 of 22
6. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 11 of 22
7. (pick ball22 room4 left)
   deleted: (at ball22 room4) (free left)
   added: (carry ball22 left)
   goals met: 11 of 22
8. (pick ball21 room4 right)
   deleted: (at ball21 room4) (free right)
   added: (carry ball21 right)
   goals met: 11 of 22
9. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 11 of 22
10. (drop ball21 roomb right)
   deleted: (carry ball21 right)
   added: (at ball21 roomb) (free right)
   goals met: 12 of 22
11. (drop ball22 roomb left)
   deleted: (carry ball22 left)
   added: (at ball22 roomb) (free left)
   goals met: 13 of 22
12. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 13 of 22
13. (pick ball20 room4 left)
   deleted: (at ball20 room4) (free left)
   added: (carry ball20 left)
   goals met: 13 of 22
14. (pick ball19 room4 right)
   deleted: (at ball19 room4) (free right)
   added: (carry ball19 right)
   goals met: 13 of 22
15. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 13 of 22
16. (drop ball19 roomb right)
   deleted: (carry ball19 right)
   added: (at ball19 roomb) (free right)
   goals met: 14 of 22
17. (drop ball20 roomb left)
   deleted: (carry ball20 left)
   added: (at ball20 roomb) (free left)
   goals met: 15 of 22
18. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 15 of 22
19. (pick ball18 room4 left)
   deleted: (at ball18 room4) (free left)
   added: (carry ball18 left)
   goals met: 15 of 22
20. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 15 of 22
21. (drop ball18 roomb left)
   deleted: (carry ball18 left)
   added: (at ball18 roomb) (free left)
   goals met: 16 of 22
22. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 16 of 22
23. (pick ball17 room3 left)
   deleted: (at ball17 room3) (free left)
   added: (carry ball17 left)
   goals met: 16 of 22
24. (pick ball16 room3 right)
   deleted: (at ball16 room3) (free right)
   added: (carry ball16 right)
   goals met: 16 of 22
25. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 16 of 22
26. (drop ball16 roomb right)
   deleted: (carry ball16 right)
   added: (at ball16 roomb) (free right)
   goals met: 17 of 22
27. (drop ball17 roomb left)
   deleted: (carry ball17 left)
   added: (at ball17 roomb) (free left)
   goals met: 18 of 22
28. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 18 of 22
29. (pick ball15 room3 left)
   deleted: (at ball15 room3) (free left)
   added: (carry ball15 left)
   goals met: 18 of 22
30. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 18 of 22
31. (drop ball15 roomb left)
   deleted: (carry ball15 left)
   added: (at ball15 roomb) (free left)
   goals met: 19 of 22
32. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 19 of 22
33. (pick ball3 rooma left)
   deleted: (at ball3 rooma) (free left)
   added: (carry ball3 left)
   goals met: 19 of 22
34. (pick ball2 rooma right)
   deleted: (at ball2 rooma) (free right)
   added: (carry ball2 right)
   goals met: 19 of 22
35. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 19 of 22
36. (drop ball2 roomb right)
   deleted: (carry ball2 right)
   added: (at ball2 roomb) (free right)
   goals met: 20 of 22
37. (drop ball3 roomb left)
   deleted: (carry ball3 left)
   added: (at ball3 roomb) (free left)
   goals met: 21 of 22
38. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 21 of 22
39. (pick ball1 rooma left)
   deleted: (at ball1 rooma) (free left)
   added: (carry ball1 left)
   goals met: 21 of 22
40. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 21 of 22
41. (drop ball1 roomb left)
   deleted: (carry ball1 left)
   added: (at ball1 roomb) (free left)
   goals met: 22 of 22
